<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"0c5f932b92e541b88213184eebdd69cfa962806f7286df8b3e9122c7248a5c79","plan_job_ref":"Job Pull Request Checks #3024 at https://github.com/GSA-TTS/FAC/actions/runs/9116216679","plan_out_hash":"099029b6c57f5a7e1e67f9f831ac849beebcae2bf772b33e75235f211b7c3028","plan_hash":"e3217e04f992ec8264e9844b4fd64f5de30ecf9753cb472e546e1ef8ab9d42cd","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 4 to add, 2 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
        id = "8be715dc-7035-f013-29a4-8233469c292a"

+       policy {
+           destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.staging.module.fac-file-scanner.cloudfoundry_app.scanner_app will be created
+   resource "cloudfoundry_app" "scanner_app" {
+       buildpack                       = "https://github.com/cloudfoundry/python-buildpack"
+       disk_quota                      = 512
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "port"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 512
+       name                            = "fac-file-scanner"
+       path                            = "../shared/modules/scanner/scanner.zip"
+       ports                           = (known after apply)
+       space                           = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 180

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

+       service_binding {
+           service_instance = "ca75ab8e-2d85-438f-b657-84a1ef4216e5"
        }
+       service_binding {
+           service_instance = "f43724f8-a94f-4ee9-9234-72aac309afad"
        }
+       service_binding {
+           service_instance = "b4cf43f9-7ada-4c21-9d16-b340672e50ae"
        }
+       service_binding {
+           service_instance = "0f3f00c6-509d-4851-bfa0-df869c2b8321"
        }
    }

  # module.staging.module.fac-file-scanner.cloudfoundry_route.scanner_route will be created
+   resource "cloudfoundry_route" "scanner_route" {
+       domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
+       endpoint = (known after apply)
+       hostname = "fac-file-scanner-staging"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
    }

  # module.staging.module.file_scanner_clamav.data.cloudfoundry_app.app will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_app" "app" {
+       buildpack                  = (known after apply)
+       command                    = (known after apply)
+       disk_quota                 = (known after apply)
+       enable_ssh                 = (known after apply)
+       environment                = (sensitive value)
+       health_check_http_endpoint = (known after apply)
+       health_check_timeout       = (known after apply)
+       health_check_type          = (known after apply)
+       id                         = (known after apply)
+       instances                  = (known after apply)
+       memory                     = (known after apply)
+       name                       = (known after apply)
+       name_or_id                 = "****************"
+       space                      = (known after apply)
+       stack                      = (known after apply)
+       state                      = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       domain   = (known after apply)
+       id       = (known after apply)
+       internal = (known after apply)
+       name     = "apps.internal"
+       org      = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.data.cloudfoundry_space.space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "space" {
+       id       = (known after apply)
+       name     = "staging"
+       org      = (known after apply)
+       org_name = "gsa-tts-oros-fac"
+       quota    = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpack                       = (known after apply)
!~      enable_ssh                      = true -> (known after apply)
+       health_check_http_endpoint      = (known after apply)
!~      health_check_invocation_timeout = 0 -> (known after apply)
!~      health_check_timeout            = 0 -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      id_bg                           = "************************************" -> (known after apply)
-       labels                          = {} -> null
        name                            = "fac-av-staging-fs"
!~      ports                           = [] -> (known after apply)
!~      space                           = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807" # forces replacement -> (known after apply) # forces replacement
+       stack                           = (known after apply)
#        (9 unchanged attributes hidden)

-       routes {
-           port  = 0 -> null
-           route = "d76ca78e-b31c-49ac-bac8-d0151c44ed82" -> null
        }
+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_network_policy.clamav_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav_routing" {
        id = "a79420b0-0919-281d-cee8-8818ccf9dede"

+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_route.clamav_route must be replaced
-/+ resource "cloudfoundry_route" "clamav_route" {
!~      domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b" # forces replacement -> (known after apply) # forces replacement
!~      endpoint = "fac-av-staging-fs.apps.internal" -> (known after apply)
!~      id       = "************************************" -> (known after apply)
+       port     = (known after apply)
!~      space    = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807" # forces replacement -> (known after apply) # forces replacement
#        (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.staging.module.cg-logshipper.module.s3-logshipper-storage.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/staging.cg-logshipper.s3-logshipper-storage/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 4 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3024](https://github.com/GSA-TTS/FAC/actions/runs/9116216679)